; domain
(define (domain briefcase)
(:predicates (at ?y ?x)
             (in ?x)
             (is-at ?x))



(:action move
  :parameters (?m ?l)
  :precondition  (is-at ?m)
  :effect (and (is-at ?l) (not (is-at ?m))
		    (forall (?x) (when (in ?x)
		      (and (at ?x ?l) (not (at ?x ?m)))))))

  (:action take-out
      :parameters (?x)
      :precondition (in ?x)
      :effect (not (in ?x)))
      
  (:action put-in
      :parameters (?x ?l)
      :precondition (and (not (in ?x)) (at ?x ?l) (is-at ?l))
      :effect (in ?x)))

; problem
(define (problem brief)
  (:domain briefcase)
  (:objects
     p1
     p2
     p3
     p4
     p5
     p6
     
     l2
     l1
     l3
     l4
     l5
     l6

     )
  (:init
   (at p1 l4 )
   (at p2 l1 )
   (at p3 l1 )
   (at p4 l1 )
   (at p5 l1 )
   (at p6 l1 )
   (is-at l1 )

   )
  (:goal
   (and
   (at p1 l1 )
   (at p2 l2 )
   (at p3 l3 )
   (at p4 l4 )
   (at p5 l5 )
   (at p6 l6 ))
   ))

; plan
1. (put-in p2 l1)
   added: (in p2)
   goals met: 0 of 6
2. (put-in p3 l1)
   added: (in p3)
   goals met: 0 of 6
3. (put-in p4 l1)
   added: (in p4)
   goals met: 0 of 6
4. (put-in p5 l1)
   added: (in p5)
   goals met: 0 of 6
5. (put-in p6 l1)
   added: (in p6)
   goals met: 0 of 6
6. (move l1 l2)
   deleted: (is-at l1) (at p2 l1) (at p3 l1) (at p4 l1) (at p5 l1) (at p6 l1)
   added: (is-at l2) (at p2 l2) (at p3 l2) (at p4 l2) (at p5 l2) (at p6 l2)
   goals met: 1 of 6
7. (take-out p2)
   deleted: (in p2)
   goals met: 1 of 6
8. (move l2 l3)
   deleted: (is-at l2) (at p3 l2) (at p4 l2) (at p5 l2) (at p6 l2)
   added: (is-at l3) (at p3 l3) (at p4 l3) (at p5 l3) (at p6 l3)
   goals met: 2 of 6
9. (take-out p3)
   deleted: (in p3)
   goals met: 2 of 6
10. (move l3 l4)
   deleted: (is-at l3) (at p4 l3) (at p5 l3) (at p6 l3)
   added: (is-at l4) (at p4 l4) (at p5 l4) (at p6 l4)
   goals met: 3 of 6
11. (put-in p1 l4)
   added: (in p1)
   goals met: 3 of 6
12. (take-out p4)
   deleted: (in p4)
   goals met: 3 of 6
13. (move l4 l1)
   deleted: (is-at l4) (at p1 l4) (at p5 l4) (at p6 l4)
   added: (is-at l1) (at p1 l1) (at p5 l1) (at p6 l1)
   goals met: 4 of 6
14. (take-out p1)
   deleted: (in p1)
   goals met: 4 of 6
15. (move l1 l5)
   deleted: (is-at l1) (at p5 l1) (at p6 l1)
   added: (is-at l5) (at p5 l5) (at p6 l5)
   goals met: 5 of 6
16. (take-out p5)
   deleted: (in p5)
   goals met: 5 of 6
17. (move l5 l6)
   deleted: (is-at l5) (at p6 l5)
   added: (is-at l6) (at p6 l6)
   goals met: 6 of 6
